app/controllers/articles_controller.rb

  def create
    # render plain: params[:article]
    @article = Article.new(article_param)
    @article.user = User.first
    if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "demo1"], ["description", "sdnskjdbjvsv"], ["created_at", "2021-07-29 06:56:14.192393"], ["updated_at", "2021-07-29 06:56:14.192393"]]

  def update
    if @article.update(article_param)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "info"], ["updated_at", "2021-08-04 06:30:11.146447"], ["id", 14]]